================================================================================
Simple comment
================================================================================

%peanutbutterjelly
  / This is the peanutbutterjelly element
  I like sandwiches!

--------------------------------------------------------------------------------

(source_file
  (tag
    (name)
    (comment)
    (text_content)))

================================================================================
Comment that wraps indented sections of code
================================================================================

/
  %p This doesn't render...
  %div
    %h1 Because it's commented out!

.foo

--------------------------------------------------------------------------------

(source_file
  (comment)
  (tag
    (class
      (class_name))))

================================================================================
Conditional comment
================================================================================

/[if IE]
  %a{ :href => 'http://www.mozilla.com/en-US/firefox/' }
    %h1 Get Firefox
%h1

--------------------------------------------------------------------------------

(source_file
  (comment)
  (tag
    (name)))

================================================================================
HAML single-line comment
================================================================================

%p foo
-# This is a comment
%p bar

--------------------------------------------------------------------------------

(source_file
  (tag
    (name)
    (text_content))
  (comment)
  (tag
    (name)
    (text_content)))

================================================================================
HAML multi-line comment
================================================================================

%p foo
-#
  This won't be displayed
    Nor will this
                   Nor will this.
%p bar

--------------------------------------------------------------------------------

(source_file
  (tag
    (name)
    (text_content))
  (comment)
  (tag
    (name)
    (text_content)))
